## 6.1 Reading and Writing Data in Text Format

In [1]:
import pandas as pd
import numpy as np

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('examples/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [22]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
names =  ['a', 'b', 'c', 'd', 'message']

In [24]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [25]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [26]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [27]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [28]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [29]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [30]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [31]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [32]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [36]:
result = pd.read_csv('examples/ex5.csv')

In [38]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [40]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [41]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [43]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Reading Text Files in Pieces

In [44]:
pd.options.display.max_rows = 10

In [46]:
result = pd.read_csv('examples/ex6.csv')

In [84]:
result['key'].value_counts()

E    368
X    364
L    346
O    343
Q    340
    ...
5    157
2    152
0    151
9    150
1    146
Name: key, Length: 36, dtype: int64

In [85]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [86]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [87]:
chunker

In [90]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [91]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

/Users/gaussic/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [92]:
tot[:10]

0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
dtype: float64

### Writing Data to Text Format

In [93]:
data = pd.read_csv('examples/ex5.csv')

In [94]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [95]:
data.to_csv('examples/out.csv')

In [96]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [97]:
import sys

In [98]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [99]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [102]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [103]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [111]:
dates = pd.date_range('1/1/2000', periods=7, freq='7D')

In [113]:
dates

DatetimeIndex(['2000-01-01', '2000-01-08', '2000-01-15', '2000-01-22',
               '2000-01-29', '2000-02-05', '2000-02-12'],
              dtype='datetime64[ns]', freq='7D')

In [121]:
ts = pd.Series(np.arange(7), index=dates)

In [122]:
ts

2000-01-01    0
2000-01-08    1
2000-01-15    2
2000-01-22    3
2000-01-29    4
2000-02-05    5
2000-02-12    6
Freq: 7D, dtype: int64

In [119]:
ts.to_csv('examples/tseries.csv')

In [120]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-08,1
2000-01-15,2
2000-01-22,3
2000-01-29,4
2000-02-05,5
2000-02-12,6

In [123]:
pd.read_csv('examples/tseries.csv')

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-08  1
2  2000-01-15  2
3  2000-01-22  3
4  2000-01-29  4
5  2000-02-05  5
6  2000-02-12  6

### Working with Delimited Formats

In [124]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [125]:
import csv

In [126]:
f = open('examples/ex7.csv')

In [127]:
reader = csv.reader(f)

In [129]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [130]:
pd.read_csv('examples/ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

In [133]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
print(lines)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [134]:
header, values = lines[0], lines[1:]

In [135]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [136]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [137]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [140]:
f = open('examples/ex7.csv')
reader = csv.reader(f, dialect=my_dialect)

In [141]:
reader = csv.reader(f, delimiter='|')

In [144]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [145]:
!cat mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

### JSON Data

In [150]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [151]:
import json

In [153]:
result = json.loads(obj)

In [156]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [157]:
asjson = json.dumps(result)

In [158]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [159]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [160]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [163]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [161]:
data = pd.read_json('examples/example.json')

In [162]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [164]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [165]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

In [166]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [167]:
len(tables)

1

In [168]:
failures = tables[0]

In [169]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [170]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [172]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### Parsing XML with lxml.objectify

In [173]:
from lxml import objectify

In [178]:
path = 'datasets/mta_perf/Performance_MNR.xml'

In [179]:
parsed = objectify.parse(open(path))

In [180]:
root = parsed.getroot()

In [182]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    elt_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        elt_data[child.tag] = child.pyval
    data.append(elt_data)

In [183]:
perf = pd.DataFrame(data)

In [185]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [186]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [187]:
root

In [188]:
root.get('href')

'http://www.google.com'

In [189]:
root.text

'Google'

## 6.2 Binary Data Format

In [190]:
frame = pd.read_csv('examples/ex1.csv')

In [191]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [192]:
frame.to_pickle('examples/frame_pickle')

In [193]:
pd.read_pickle('examples/frame_Pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Using HDF5 Format

In [200]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [201]:
store = pd.HDFStore('mydata.h5')

In [202]:
store['obj1'] = frame

In [203]:
store['obj1_col'] = frame['a']

In [207]:
print(store.info())

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5
/obj1                frame        (shape->[100,1])
/obj1_col            series       (shape->[100])

In [208]:
store['obj1']

           a
0   0.379244
1  -2.004045
2   0.268682
3   0.422711
4   1.351132
..       ...
95 -1.945273
96  0.112343
97  0.729199
98 -1.822559
99  0.330559

[100 rows x 1 columns]

In [209]:
store.put('obj2', frame, format='table')

In [210]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.458474
11 -0.731148
12 -1.455484
13  1.389643
14 -0.017808
15  0.534535

In [212]:
frame.to_hdf('my_data.h5', 'obj3', format='table')

In [214]:
pd.read_hdf('my_data.h5', 'obj3', where=['index < 5'])

          a
0  0.379244
1 -2.004045
2  0.268682
3  0.422711
4  1.351132

### Reading Microsoft Excel Files

In [215]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [216]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [217]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [218]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [219]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [220]:
frame.to_excel(writer, 'Sheet1')

In [221]:
writer.save()

In [222]:
frame.to_excel('examples/ex2.xlsx')

## 6.2 Interacting with Web APIs

In [234]:
import requests

In [235]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [236]:
resp = requests.get(url)

In [238]:
resp

In [239]:
data = resp.json()

In [241]:
data[0]['title']

'BENCH: implement asvs for get_resolution'

In [242]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [243]:
issues

,number,title,labels,state
0,35075,BENCH: implement asvs for get_resolution,[],open
1,35074,TST: Test for groupby transform on categorical...,[],open
2,35073,REF: de-duplicate month_offset in tslibs.fields,[],open
3,35072,Add test apply dtype,[],open
4,35071,CLN: remove unnecessary get_timezone calls,[],open
...,...,...,...,...
25,35038,BUG: DataFrame.append with empty DataFrame and...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,35037,ERR: could pandas suggest to use bitwise opera...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
27,35035,BUG: fix read_excel error for header=None and ...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
28,35032,API: implement __array_function__ for Extensio...,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2...",open
29,35030,On traces of #33982,[],open

## 6.4 Interacting with Databases

In [244]:
import sqlite3

In [245]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);
"""

In [246]:
con = sqlite3.connect('mydata.sqlite')

In [247]:
con.execute(query)

In [248]:
con.commit()

In [249]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [250]:
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

In [251]:
con.executemany(stmt, data)

In [252]:
con.commit()

In [253]:
cursor = con.execute('select * from test')

In [254]:
rows = cursor.fetchall()

In [255]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [256]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [257]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [258]:
import sqlalchemy as sqla

In [259]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [260]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5